experimental/glm52_b300_fixed_seq/results/c2-three-arm-dp-mem80-20260920/runs/c2-w4a4-trtllm-dp-mem80-20260920/8k1k/w4a4-trtllm/tp4_conc16/benchmark.log
+ run_server_client env PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920 python3 -m infx.bench_serving.benchmark_serving --model nvidia/GLM-5.2-NVFP4 --backend vllm --base-url http://0.0.0.0:30000 --dataset-name random --random-input-len 8192 --random-output-len 1024 --random-range-ratio 0.8 --num-prompts 160 --max-concurrency 16 --request-rate inf --ignore-eos --save-result --num-warmups 32 --percentile-metrics ttft,tpot,itl,e2el --result-dir /data/home/ziangli/inferencex-glm52-b300/results/c2-w4a4-trtllm-dp-mem80-20260920/8k1k/w4a4-trtllm/tp4_conc16 --result-filename result.json --use-chat-template --tokenizer /data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4
+ [[ -n /tmp/inferencex-server-state.g8JKv2 ]]
+ PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920
+ python3 -m infx.bench_serving.server_watch run --state /tmp/inferencex-server-state.g8JKv2 -- env PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920 python3 -m infx.bench_serving.benchmark_serving --model nvidia/GLM-5.2-NVFP4 --backend vllm --base-url http://0.0.0.0:30000 --dataset-name random --random-input-len 8192 --random-output-len 1024 --random-range-ratio 0.8 --num-prompts 160 --max-concurrency 16 --request-rate inf --ignore-eos --save-result --num-warmups 32 --percentile-metrics ttft,tpot,itl,e2el --result-dir /data/home/ziangli/inferencex-glm52-b300/results/c2-w4a4-trtllm-dp-mem80-20260920/8k1k/w4a4-trtllm/tp4_conc16 --result-filename result.json --use-chat-template --tokenizer /data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4
Namespace(backend='vllm', base_url='http://0.0.0.0:30000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=16, model='nvidia/GLM-5.2-NVFP4', tokenizer='/data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4', best_of=1, use_beam_search=False, num_prompts=160, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, metadata=None, result_dir='/data/home/ziangli/inferencex-glm52-b300/results/c2-w4a4-trtllm-dp-mem80-20260920/8k1k/w4a4-trtllm/tp4_conc16', result_filename='result.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='90,99,99.9', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=8192, random_output_len=1024, random_range_ratio=0.8, random_prefix_len=0, use_chat_template=True, random_num_workers=0, dsv4=False, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, num_warmups=32)
Generating 160 prompts using 8 worker processes...
Prompt generation completed in 4.9s
-------------------  Input/Output Length Statistics  -------------------
 input_lens : min=6567  max=8190  mean=7346.95  avg_token_mismatch=12.00 
 output_lens: min=819   max=1024  mean=915.16  
------------------------------------------------------------------------ 

Starting initial single prompt test run...
Warming up with 32 requests...
100%|██████████| 32/32 [00:32<00:00,  1.01s/it]
Warmup completed.
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
  0%|          | 0/160 [00:00<?, ?it/s]Starting main benchmark run...
100%|██████████| 160/160 [02:19<00:00,  1.15it/s]
============ Serving Benchmark Result ============
Successful requests:                     160       
Benchmark duration (s):                  139.50    
Total input tokens:                      1175512   
Total generated tokens:                  146426    
Request throughput (req/s):              1.15      
Output token throughput (tok/s):         1049.65   
Total Token throughput (tok/s):          9476.30   
---------------Time to First Token----------------
Mean TTFT (ms):                          1257.46   
Median TTFT (ms):                        751.05    
P90 TTFT (ms):                           2373.63   
P99 TTFT (ms):                           10587.99  
P99.9 TTFT (ms):                         12013.05  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          13.37     
Median TPOT (ms):                        13.39     
P90 TPOT (ms):                           15.72     
P99 TPOT (ms):                           18.09     
P99.9 TPOT (ms):                         19.82     
---------------Inter-token Latency----------------
Mean ITL (ms):                           1102.58   
Median ITL (ms):                         823.16    
P90 ITL (ms):                            2396.90   
P99 ITL (ms):                            4236.89   
P99.9 ITL (ms):                          6953.69   
----------------End-to-end Latency----------------
Mean E2EL (ms):                          13489.22  
Median E2EL (ms):                        13361.23  
P90 E2EL (ms):                           15993.02  
P99 E2EL (ms):                           24401.71  
P99.9 E2EL (ms):                         26304.82  
==================================================
+ set +x